Antes de seguir, recordamos las preguntas que nos planteamos al principio del pair programming de EDA para dirigir nuestro an√°lisis.

¬øEs Australia es el sitio m√°s peligroso y letal para estar relajada en la playa?

¬øCu√°l es el rango de edad que sufre la mayor√≠a de los ataques?

Independientemente de la edad, sufren los hombres m√°s ataques que las mujeres?

¬øEn qu√© mes ocurren m√°s ataques?

¬øCu√°l es la relaci√≥n entre la especie y el tipo de ataque (si es fatal o no)?

¬øC√≥mo han evolucionado los ataques a lo largo del tiempo?


Tabla actualizada de columnas limpias

![alt text](LimpiezaIV.png "Tabla Limpieza IV")

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import sidetable as stb
pd.options.display.max_rows=None
plt.rcParams['figure.figsize']= (15,12)

In [2]:
df = pd.read_csv('datos/attacks_limpieza_3.csv', index_col=0)
df.head(2)

,case_number,year,type,country,area,location,activity,name,age,time,species_,href,date,month,fatal_y/n,sex_m_f
0,2018.06.25,2018,Boating,usa,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,57.0,18h00,white shark,http://sharkattackfile.net/spreadsheets/pdf_di...,25-Jun-2018,Jun,N,F
1,2018.06.03.a,2018,Unprovoked,brazil,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,18.0,Late afternoon,tiger shark,http://sharkattackfile.net/spreadsheets/pdf_di...,03-Jun-2018,Jun,Y,M


‚Äã
Es el momento de ponernos a trabajar con los valores nulos üí™üèΩ. A lo largo de este ejercicio de pair programming vamos a intentar eliminar los valores nulos de nuestras columnas. En la lecci√≥n hemos aprendido varios m√©todos, nosotras os planteamos los ejercicios pero sentiros libres de usar el m√©todo que m√°s se adapte a vuestras necesidades. Manos a la obra!

Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. ¬øHay alguna columna con una gran cantidad de nulos? En caso de que sea as√≠ deberemos eliminarla.

Es el momento de eliminar los nulos:

- Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.

In [3]:
df.stb.missing()

             missing  total    percent
month            181   1672  10.825359
time             160   1672   9.569378
age              158   1672   9.449761
fatal_y/n         99   1672   5.921053
location          51   1672   3.050239
area              46   1672   2.751196
activity          31   1672   1.854067
country           10   1672   0.598086
name               9   1672   0.538278
case_number        0   1672   0.000000
year               0   1672   0.000000
type               0   1672   0.000000
species_           0   1672   0.000000
href               0   1672   0.000000
date               0   1672   0.000000
sex_m_f            0   1672   0.000000

In [4]:
df1 = df.copy()

In [5]:
df1['age'].fillna(df1['age'].median, inplace = True)

- En relaci√≥n a la columna de country al tratarse de una columna de tipo categ√≥rica, reemplazad los valores nulos por una nueva categ√≥ria que se llame Unknown.

In [6]:
df1['country'].replace(np.nan, "Unknown", inplace = True)

In [7]:
df1['country'].unique()

array(['usa', 'brazil', 'australia', 'england', 'costa rica', 'maldives',
       'south africa', 'cuba', 'spain', 'bahamas', 'indonesia', 'egypt',
       'new zealand', 'french polynesia', 'new caledonia', 'ecuador',
       'thailand', 'reunion', 'mexico', 'jamaica', 'italy',
       'papua new guinea', 'russia', 'seychelles', 'vietnam', 'guam',
       'mozambique', 'scotland', 'united kingdom', 'taiwan', 'croatia',
       'fiji', 'tonga', 'st. maartin', 'grand cayman', 'vanuatu',
       'venezuela', 'turks & caicos', 'okinawa', 'marshall islands',
       'mauritius', 'hong kong', 'japan', 'south korea', 'israel',
       'micronesia', 'columbia', 'new britain', 'palau',
       'solomon islands', 'federated states of micronesia', 'greece',
       'british west indies', 'north pacific ocean', 'bermuda',
       'philippines', 'american samoa', 'pacific ocean', 'senegal',
       'argentina', 'el salvador', 'iraq', 'panama', 'india', 'Unknown',
       'barbados', 'martinique', 'guinea', 'greenland', 'france',
       'mediterranean sea', 'sweden', 'iceland', 'roatan',
       'between portugal & india', 'canada', 'kenya', 'uruguay',
       'lebanon', 'sudan', 'djibouti', 'libya', 'sri lanka', 'bahrein',
       'korea', 'iran', 'red sea?', 'singapore', 'madagascar',
       'nicaragua', 'kiribati', 'saudi arabia', 'burma', 'belize',
       'asia?', 'ceylon (sri lanka)'], dtype=object)

- Reemplazad los valores nulos de la columna fatal por Unknown.

In [8]:
df1['fatal_y/n'].replace(np.nan, "Unknown", inplace = True)

In [9]:
df1.stb.missing()

             missing  total    percent
month            181   1672  10.825359
time             160   1672   9.569378
location          51   1672   3.050239
area              46   1672   2.751196
activity          31   1672   1.854067
name               9   1672   0.538278
case_number        0   1672   0.000000
year               0   1672   0.000000
type               0   1672   0.000000
country            0   1672   0.000000
age                0   1672   0.000000
species_           0   1672   0.000000
href               0   1672   0.000000
date               0   1672   0.000000
fatal_y/n          0   1672   0.000000
sex_m_f            0   1672   0.000000

In [10]:
df1['fatal_y/n'].unique()

array(['N', 'Y', 'Unknown'], dtype=object)

- Reemplazad los valores nulos de la columna type por el valor m√°s frecuente (la moda).

In [11]:
df1.type.mode()[0]

'Unprovoked'

- Reemplazad los valores nulos de la columna fecha por Unknown.

In [12]:
df1['type'].replace(np.nan, df.type.mode()[0], inplace = True)

In [13]:
df1['type'].unique()

array(['Boating', 'Unprovoked', 'Provoked', 'Invalid', 'Sea Disaster',
       'Boat'], dtype=object)

- Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair.

In [ ]:
df1.to_csv('datos/attacks_limpieza_4.csv')